import { useTheme } from '../../context/ThemeContext';

import MetricFormulaImage from '../../assets/images/metric-formula.svg';
import UsFormulaImage from '../../assets/images/us-formula.svg';
import styles from './About.module.scss';

export default function About() {
  const { theme } = useTheme();

  return (
    <section>
      <article>
        <h2>شاخص توده بدنی یا BMI چیست؟</h2>
        <p>
          شاخص توده بدنی یا بی‌ام‌آی (به انگلیسی: body mass index، مخفف BMI) سنجشی آماری برای مقایسه وزن و قد یک فرد
          است. در واقع این سنجش میزان چاقی را اندازه‌گیری نمی‌کند بلکه ابزاری مناسب است تا سلامت وزن فرد با توجه به قدش
          تخمین زده شود. این شاخص در بین سال‌های ۱۸۳۰ تا ۱۸۵۰ توسط آدولف کوتله دانشمند بلژیکی ابداع شد. نحوه محاسبه آن
          بسیار ساده است و در بسیاری جاها برای مشخص کردن بیش‌وزنی و کم‌وزنی استفاده می‌شود.
        </p>
        <h2>فرمول محاسبه</h2>
        <p>
          شاخص توده بدنی از طریق تقسیم وزن فرد به کیلوگرم بر توان دوم (x²) قدش به متر بدست می‌آید و فرمول محاسبه آن در
          سیستم متریک چنین و یا آمریکایی چنین است:
        </p>
        <div className={theme === 'light' ? styles.imageBox : `${styles.imageBox} ${styles.dark}`}>
          <p>
            <strong>BMI</strong>
          </p>
          <img src={MetricFormulaImage} alt='An image about BMI formula in the metric system' loading="lazy" />
          <img src={UsFormulaImage} alt='An image about BMI formula in the us system' loading="lazy" />
        </div>
        <br />
        <p>
          شاخص توده بدنی یک ابزار اندازه گیری است که نشان می‌دهد قد و وزن شما تا چه حد با هم تناسب دارند و آیا دچار
          کمبود یا اضافه وزن هستید یا خیر؟ برای به دست آوردن نتایج دانستن فاکتورهایی همچون سن، وزن، قد و جنسیت شما اهمیت
          دارد. شاخص توده بدنی عبارت است از تقسیم وزن (کیلوگرم) بر قد (متر) به توان ۲. این شاخص تنها نشان دهنده سطح چربی
          بدن بوده و قادر به تشخیص میزان سلامت یا چاقی فرد نمی‌باشد. البته این روش قطعی نیست و معایبی نیز دارد. مثلا به
          استخوان بندی و میزان عضله‌های فرد در این روش اهمیتی داده نمی‌شود، در حالی که همانطور که می دانیم ممکن است یک
          کیلوگرم عضله و یک کیلوگرم چربی وزن یکسانی داشته باشند، اما حجم عضله کمتر و چگالی آن بیش از چربی است.
        </p>
        <br />
        <table>
          <thead>
            <tr>
              <th>رده</th>
              <th>شاخص توده بدنی</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>دچار کمبود وزن شدید</td>
              <td>کمتر از ۱۶</td>
            </tr>
            <tr>
              <td>کمبود وزن</td>
              <td>از ۱۶ تا ۱۸,۵</td>
            </tr>
            <tr>
              <td>نرمال</td>
              <td>از ۱۸,۵ تا ۲۵</td>
            </tr>
            <tr>
              <td>اضافه وزن</td>
              <td>از ۲۵ تا ۳۰</td>
            </tr>
            <tr>
              <td>چاقی کلاس ۱</td>
              <td>از ۳۰ تا ۳۵</td>
            </tr>
            <tr>
              <td>چاقی کلاس ۲</td>
              <td>از ۳۵ تا ۴۰</td>
            </tr>
            <tr>
              <td>چاقی کلاس ۳</td>
              <td>بیش از ۴۰</td>
            </tr>
          </tbody>
        </table>
        <br />
        <h2>شاخص توده بدنی درسنین مختلف باید چه مقدار باشد؟</h2>
        <p>
          افراد در هر سن و سالی بهتر است که شاخص توده بدنی یا BMI خود را در یک محدوده خاص نگاه دارند. در جدول زیر BMI
          توصیه شده و مناسبِ افراد در سنین مختلف از نوجوانی تا کهنسالی درج شده است. افراد بهتر است در سنین زیر شاخص توده
          بدنی متناسبی بین 21 تا 27 داشته باشند.
        </p>
        <br />
        <table>
          <thead>
            <tr>
              <th>محدوده سنی</th>
              <th>شاخص توده بدنی مطلوب</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td>۱۷ تا ۲۴ سال</td>
              <td>۲۱</td>
            </tr>
            <tr>
              <td>۲۴ تا ۴۴ سال</td>
              <td>۲۴</td>
            </tr>
            <tr>
              <td>۴۴ تا ۵۴ سال</td>
              <td>۲۵</td>
            </tr>
            <tr>
              <td>۵۴ به بالا</td>
              <td>۲۷</td>
            </tr>
          </tbody>
        </table>
        <br />
        <h2>BMI چه چیزهایی را به ما نشان نمی‌دهد؟</h2>
        <p>
          شاخص توده بدنی تنها یک معیار ساده و سطحی است و فقط وضعیت وزنی ما را نشان می‌دهد. و با اینکه میزان چربی بدن ما
          را نیز به صورت حدودی مشخص می‌کند اما نحوه توزیع چربی‌ها را عنوان نمی‌کند و همچنین تمایزی بین چربی و عضله قائل
          نیست.
        </p>
        <p>
          برای مثال اگر ورزشکاری که به صورت حرفه‌ای ورزش می‌کند و بافت عضلانی قابل توجه (به همراه مقدار بسیار جزئی چربی
          داشته باشد) و شاخص توده بدنی این ورزشکار ۳۰ باشد، مطابق فرمول BMI باید ورزشکار چاق باشد. این درحالی است که
          ورزشکاران عضله بیشتری دارند و چاق نیستند.
        </p>
        <h2>خطرات بالا بودن BMI یا شاخص توده بدنی</h2>
        <p>
          با توجه به اینکه اضافه‌وزن مشکلاتی مانند ناراحتی‌های قلب و عروق، دیابت و … را برای افراد به همراه دارد و کاهش
          وزن خطراتی چون سوءتغذیه، کم‌خونی و پوکی استخوان مهم است که BMI یا شاخص توده بدنی خود را در وضعیت مناسبی قرار
          دهیم. خطرات بالا بودن BMI چنان هولناک است که به‌راستی باید برای کاهش آن به فکر استفاده از راهکارهای ذکرشده در
          اسرع وقت بود.
        </p>
        <ul>
          <li>
            <h3>افزایش شدت کارکرد قلب</h3>
            <p>
              بافت‌های چربی اکسیژن فراوانی را جذب می‌کنند، بنابراین قلب افراد با شاخص توده بدنی بالا ناچار است برای
              تأمین اکسیژن قلب چندین برابر افراد معمول عمل تپش را انجام دهد که این امر فشار مضاعفی بر سیستم قلب و عروق
              چنین افرادی وارد می‌سازد. بدین ترتیب احتمال بروز بیماری عروق کرونر قلب نیز در چنین افرادی به‌مراتب بیشتر
              است.
            </p>
          </li>
          <li>
            <h3>افزایش سطح تری‌گلیسیرید، کلسترول و فشارخون</h3>
            <p>
              آنچه افراد چاق همیشه از آن وحشت دارند، چربی و فشارخون بالا است که تا به‌تناسب اندام نرسند گریزی از این
              بیماری‌ها نیست. BMI اگرچه درصد چربی را نشان نداده یا برای نمایش نوع چربی ناتوان است اما با ابراز اضافه‌وزن
              به افراد با توده بدنی در مرز هشدار آن‌ها را از این خطر بزرگ آگاه می‌سازد.
            </p>
          </li>
          <li>
            <h3>سکته مغزی</h3>
            <p>
              اگر به فکر غربالگری چربی‌های بدن و رسیدن به شاخص توده بدنی مناسب نباشید، متأسفانه سکته مغزی نیز عارضه
              خطرناک دیگری است که باید به فهرست مشکلات خود اضافه نمایید. به‌واقع این عارضه مهلک در میان افراد چاق با رشد
              سریع‌تری بروز و ظهور دارد و آن‌ها را در معرض ابتلا به خود می‌گذارد.
            </p>
          </li>
        </ul>
        <br />
        <a
          href='https://fa.wikipedia.org/wiki/%D8%B4%D8%A7%D8%AE%D8%B5_%D8%AA%D9%88%D8%AF%D9%87_%D8%A8%D8%AF%D9%86%DB%8C'
          target='_blank'
          rel='noopener noreferrer'
        >
          منبع: ویکی پدیای فارسی
        </a>
      </article>
    </section>
  );
}
